# BuiltInFailures.SplineFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SplineFailures Class
BuiltInFailures Class Members See Also
---
Failures about Spline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SplineFailures
```

Visual Basic
---
```text
Public NotInheritable Class SplineFailures
```

Visual C++
---
```text
public ref class SplineFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SplineFailures
# See Also
BuiltInFailures..::..SplineFailures Members
Autodesk.Revit.DB Namespace